malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
/**
 * @file simcom_driver.c
 * @brief Implementacao do driver do modem celular SIMCom via comandos AT diretos.
 * @details Este modulo gerencia a comunicacao serial com o modem celular,
 *          o processamento de URCs de entrada (como mensagens MQTT recebidas)
 *          e a maquina de estados de conexao MQTT/SMS/GPS.
 *
 * @author Antigravity Agent
 * @date 2026-06-15
 */

#include "simcom_driver.h"
#include <string.h>
#include <stdlib.h>
#include <time.h>
#include <sys/time.h>
#include "driver/uart.h"
#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_event.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "ble_mobile.h"
#include "cmd_parser.h"
#include "cJSON.h"
#include "stm32_cmd.h"

static const char *TAG = "SIMCOM_DRV";

/* --- Variaveis Estaticas --- */

/** @brief Mutex para serializar o envio de comandos AT na UART. */
static SemaphoreHandle_t simcom_mutex = NULL;

/** @brief Semaforo para sinalizar quando a resposta a um comando AT foi concluida. */
static SemaphoreHandle_t response_sem = NULL;

/** @brief Buffer para acumular a resposta do comando AT atualmente em execucao. */
static char cmd_response_buf[SIMCOM_UART_BUF_SIZE * 2];
static int cmd_response_len = 0;
static bool awaiting_response = false;

/** @brief Estado operacional atual do modem. */
static simcom_state_t modem_state = SIMCOM_STATE_OFF;

/** @brief Flag indicando se a conectividade celular esta suspensa (Wi-Fi ativo). */
static bool cellular_suspended = false;

/** @brief Flag indicando se a conexao MQTT celular esta ativa. */
static bool cellular_mqtt_connected = false;

/** @brief IMEI lido do modem celular. */
static char modem_imei[32] = "bastao-esp-default";

/** @brief Flag indicando se o GPS foi ativado fisicamente no modem. */
static bool gps_powered_on = false;

/** @brief APN configurada no sistema. */
static simcom_apn_config_t stored_apn = {0};

/** @brief Handle da task de recepcao UART para evitar recriacoes. */
static TaskHandle_t simcom_rx_task_handle = NULL;

/** @brief Flag para controlar primeira inicializacao do modem (probe de chips). */
static bool first_init_done = false;

/** @brief Configuracao de MQTT ativa armazenada para reconexoes. */
static mqtt_publisher_config_t stored_mqtt_config = {0};
static bool mqtt_config_loaded = false;

/* --- Cache de metricas celulares --- */
static int cached_rssi = 99;
static int cached_ber = -1;
static cellular_tech_t cached_tech = CELLULAR_TECH_NONE;
static int cached_mcc = 0;
static int cached_mnc = 0;
static char cached_operator_name[32] = {0};
static int cached_rsrp = -140;
static int cached_rsrq = -20;
static int cached_sinr = -20;
static char cached_ceer[64] = "Nenhum";

/* --- Prototipos de Funcoes Privadas --- */
static esp_err_t at_send_cmd(const char *cmd, const char *expected_resp,
                             char *response_buf, size_t buf_size,
                             uint32_t timeout_ms);
static esp_err_t at_send_cmd_internal(const char *cmd, const char *expected_resp,
                                      char *response_buf, size_t buf_size,
                                      uint32_t timeout_ms);
static void extract_digits(const char *src, char *dst, size_t max_len);
static esp_err_t query_cpsi_metrics(void);
static esp_err_t query_ceer_log(void);
static void process_sms_command(int index, const char *sender, const char *body);
static void process_simcom_line(const char *line);
static void simcom_uart_rx_task(void *pvParameters);
static void simcom_watchdog_task(void *pvParameters);
static esp_err_t simcom_driver_get_ccid(char *ccid_out, size_t max_len);
static esp_err_t at_init_sequence(void);
static esp_err_t wait_for_network_registration(uint32_t timeout_ms);

/* --- Implementacao do Parser e Comunicacao Serial --- */

static esp_err_t at_send_cmd_internal(const char *cmd, const char *expected_resp,
                                      char *response_buf, size_t buf_size,
                                      uint32_t timeout_ms) {
    // Drena semaforo pendente de comando anterior (se houver)
    xSemaphoreTake(response_sem, 0);

    // Limpa buffer de resposta e prepara flag
    memset(cmd_response_buf, 0, sizeof(cmd_response_buf));
    cmd_response_len = 0;
    awaiting_response = true;

    // Envia o comando
    if (cmd != NULL && strlen(cmd) > 0) {
        ESP_LOGD(TAG, "AT TX >> %s", cmd);
        ESP_LOGI(TAG, "AT TX >> %s", cmd);
        int written = uart_write_bytes(SIMCOM_UART_PORT, cmd, strlen(cmd));
        if (written < 0) {
            ESP_LOGE(TAG, "Erro ao escrever na UART do SIMCom.");
            awaiting_response = false;
            return ESP_FAIL;
        }
    }

    // Aguarda o semaforo da task RX
    esp_err_t ret = ESP_OK;
    if (xSemaphoreTake(response_sem, pdMS_TO_TICKS(timeout_ms)) != pdTRUE) {
        ESP_LOGW(TAG, "AT Timeout para comando: %s (timeout=%lums)", cmd ? cmd : "NULL", (unsigned long)timeout_ms);
        ret = ESP_ERR_TIMEOUT;
    } else {
        ESP_LOGD(TAG, "AT RX << %s", cmd_response_buf);
        
        // Se o chamador forneceu buffer, copia a resposta
        if (response_buf != NULL && buf_size > 0) {
            strncpy(response_buf, cmd_response_buf, buf_size - 1);
            response_buf[buf_size - 1] = '\0';
        }

        // Valida se contem o esperado ou falhou
        if (strstr(cmd_response_buf, "ERROR") != NULL) {
            ret = ESP_FAIL;
        } else if (expected_resp != NULL && strstr(cmd_response_buf, expected_resp) == NULL) {
            ret = ESP_FAIL;
        }
    }

    awaiting_response = false;
    ESP_LOGD(TAG, "at_send_cmd_internal: ret=%d cmd=%s", ret, cmd ? cmd : "NULL");
    return ret;
}

static esp_err_t at_send_cmd(const char *cmd, const char *expected_resp,
                             char *response_buf, size_t buf_size,
                             uint32_t timeout_ms) {
    if (simcom_mutex == NULL) {
        ESP_LOGE(TAG, "at_send_cmd: mutex NULL para cmd=%s", cmd ? cmd : "NULL");
        return ESP_ERR_INVALID_STATE;
    }

