malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
    ESP_LOGI(TAG, "[INIT] Iniciando sequencia AT (sem=%p mutex=%p)...",
             (void*)response_sem, (void*)simcom_mutex);

    // 1. Eco
    ESP_LOGI(TAG, "[INIT] Step 1: testando AT...");
    err = at_send_cmd("AT\r\n", "OK", NULL, 0, 5000);
    ESP_LOGI(TAG, "[INIT] Step 1 resultado: err=%d", err);
    if (err != ESP_OK) {
        ESP_LOGI(TAG, "[INIT] Step 1b: reset CFUN e retentativa...");
        at_send_cmd("AT+CFUN=1,1\r\n", "OK", NULL, 0, 10000);
        vTaskDelay(pdMS_TO_TICKS(5000));
        err = at_send_cmd("AT\r\n", "OK", NULL, 0, 5000);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Modem nao responde ao comando AT inicial.");
            return err;
        }
    }

    // 2. Mantem eco ativo para debug
    ESP_LOGI(TAG, "[INIT] Step 2: mantendo eco ativo (ATE1)...");
    at_send_cmd("ATE1\r\n", "OK", NULL, 0, 5000);
    ESP_LOGI(TAG, "[INIT] Step 2 concluido.");
    
    // 3. Hot swap SIM
    ESP_LOGI(TAG, "[INIT] Step 3: configurando hot swap SIM...");
    at_send_cmd("AT+UIMHOTSWAPLEVEL=0\r\n", "OK", NULL, 0, 3000);
    at_send_cmd("AT+UIMHOTSWAPON=1\r\n", "OK", NULL, 0, 3000);
    ESP_LOGI(TAG, "[INIT] Step 3 concluido.");

    // 4. Sonda ambos os slots ou escolhe o slot ativo ja conhecido
    int detected_slot = -1;
    char detected_ccid[32] = "";
    char slot0_ccid[32] = "";
    char slot1_ccid[32] = "";
    bool slot0_found = false;
    bool slot1_found = false;
    bool sim_found = false;
    int slot0_rssi = 99;
    int slot1_rssi = 99;
    char sim_resp[AT_RESPONSE_BUF_SIZE];

    if (first_init_done) {
        int active_slot = bastao_current_status.active_sim_slot;
        ESP_LOGI(TAG, "[INIT] Re-inicializacao Watchdog: Usando SIM Slot ativo %d (sem sondar)...", active_slot);
        at_send_cmd("AT+CFUN=0\r\n", "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(500));
        char select_cmd[64];
        snprintf(select_cmd, sizeof(select_cmd), "AT*SELECTSIMSLOT=%d\r\n", active_slot);
        at_send_cmd(select_cmd, "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(500));
        at_send_cmd("AT+CFUN=1\r\n", "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(2000));

        err = at_send_cmd("AT+CPIN?\r\n", "READY", sim_resp, sizeof(sim_resp), 5000);
        if (err == ESP_OK) {
            sim_found = true;
            detected_slot = active_slot;
            simcom_driver_get_ccid(detected_ccid, sizeof(detected_ccid));
        } else {
            ESP_LOGE(TAG, "[INIT] SIM Slot %d nao respondeu READY.", active_slot);
        }
    } else {
        // --- Sonda slot 0 ---
        ESP_LOGI(TAG, "[INIT] Step 4a: sondando SIM slot 0...");
        at_send_cmd("AT+CFUN=0\r\n", "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(500));
        at_send_cmd("AT*SELECTSIMSLOT=0\r\n", "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(500));
        at_send_cmd("AT+CFUN=1\r\n", "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(5000));

        err = at_send_cmd("AT+CPIN?\r\n", "READY", sim_resp, sizeof(sim_resp), 5000);
        if (err == ESP_OK) {
            slot0_found = true;
            simcom_driver_get_ccid(slot0_ccid, sizeof(slot0_ccid));
            // Tenta ler sinal do slot 0
            int r = 99, b = -1;
            simcom_driver_get_signal_quality(&r, &b);
            slot0_rssi = r;
            ESP_LOGI(TAG, "Slot 0: chip=OK, ccid=%s, rssi=%d dBm", slot0_ccid, slot0_rssi);
        } else {
            ESP_LOGI(TAG, "Slot 0: sem chip detectado.");
        }

        // --- Sonda slot 1 ---
        ESP_LOGI(TAG, "[INIT] Step 4b: sondando SIM slot 1...");
        at_send_cmd("AT+CFUN=0\r\n", "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(500));
        at_send_cmd("AT*SELECTSIMSLOT=1\r\n", "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(500));
        at_send_cmd("AT+CFUN=1\r\n", "OK", NULL, 0, 5000);
        vTaskDelay(pdMS_TO_TICKS(5000));

        err = at_send_cmd("AT+CPIN?\r\n", "READY", sim_resp, sizeof(sim_resp), 5000);
        if (err == ESP_OK) {
            slot1_found = true;
            simcom_driver_get_ccid(slot1_ccid, sizeof(slot1_ccid));
            int r = 99, b = -1;
            simcom_driver_get_signal_quality(&r, &b);
            slot1_rssi = r;
            ESP_LOGI(TAG, "Slot 1: chip=OK, ccid=%s, rssi=%d dBm", slot1_ccid, slot1_rssi);
        } else {
            ESP_LOGI(TAG, "Slot 1: sem chip detectado.");
        }

        // --- Escolhe o melhor slot ---
        if (slot0_found && slot1_found) {
            // Ambos tem chip: escolhe o de melhor sinal (> menos negativo)
            if (slot1_rssi > slot0_rssi && slot1_rssi < 30) {
                detected_slot = 1;
                strcpy(detected_ccid, slot1_ccid);
                // Ja esta no slot 1
                ESP_LOGI(TAG, "Ambos chips OK. Escolhido slot 1 (rssi=%d > slot0=%d).",
                         slot1_rssi, slot0_rssi);
            } else {
                detected_slot = 0;
                strcpy(detected_ccid, slot0_ccid);
                // Volta para slot 0
                at_send_cmd("AT+CFUN=0\r\n", "OK", NULL, 0, 5000);
                vTaskDelay(pdMS_TO_TICKS(500));
                at_send_cmd("AT*SELECTSIMSLOT=0\r\n", "OK", NULL, 0, 5000);
                vTaskDelay(pdMS_TO_TICKS(500));
                at_send_cmd("AT+CFUN=1\r\n", "OK", NULL, 0, 5000);
                vTaskDelay(pdMS_TO_TICKS(5000));
                ESP_LOGI(TAG, "Ambos chips OK. Mantido slot 0 (rssi=%d >= slot1=%d).",
                         slot0_rssi, slot1_rssi);
            }
            sim_found = true;
        } else if (slot0_found) {
            detected_slot = 0;
            strcpy(detected_ccid, slot0_ccid);
            // Volta para slot 0 (estavamos no 1 apos a sonda)
            at_send_cmd("AT+CFUN=0\r\n", "OK", NULL, 0, 5000);
            vTaskDelay(pdMS_TO_TICKS(500));
            at_send_cmd("AT*SELECTSIMSLOT=0\r\n", "OK", NULL, 0, 5000);
            vTaskDelay(pdMS_TO_TICKS(500));
            at_send_cmd("AT+CFUN=1\r\n", "OK", NULL, 0, 5000);
            vTaskDelay(pdMS_TO_TICKS(5000));
            sim_found = true;
            ESP_LOGI(TAG, "Apenas slot 0 tem chip.");
        } else if (slot1_found) {
            detected_slot = 1;
            strcpy(detected_ccid, slot1_ccid);
            // Ja esta no slot 1
            sim_found = true;
            ESP_LOGI(TAG, "Apenas slot 1 tem chip.");
        } else {
            // Nenhum chip: fallback slot 0
            ESP_LOGE(TAG, "Nenhum SIM Card detectado nos slots 0 ou 1.");
            at_send_cmd("AT+CFUN=0\r\n", "OK", NULL, 0, 5000);
            vTaskDelay(pdMS_TO_TICKS(500));
            at_send_cmd("AT*SELECTSIMSLOT=0\r\n", "OK", NULL, 0, 5000);
            vTaskDelay(pdMS_TO_TICKS(500));
            at_send_cmd("AT+CFUN=1\r\n", "OK", NULL, 0, 5000);
        }
    }

    bastao_current_status.sim_present = sim_found;
    bastao_current_status.active_sim_slot = (detected_slot != -1) ? detected_slot : 0;
    strncpy(bastao_current_status.sim_ccid, detected_ccid, sizeof(bastao_current_status.sim_ccid) - 1);

