malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
    // 5. IMEI
    char imei_resp[AT_RESPONSE_BUF_SIZE];
    if (modem_imei[0] == '\0' || strcmp(modem_imei, "bastao-esp-default") == 0) {
        ESP_LOGI(TAG, "[INIT] Step 5: lendo IMEI...");
        err = at_send_cmd("AT+GSN\r\n", "OK", imei_resp, sizeof(imei_resp), 5000);
        if (err == ESP_OK) {
            extract_digits(imei_resp, modem_imei, sizeof(modem_imei));
            strncpy(bastao_current_status.sim_imei, modem_imei, sizeof(bastao_current_status.sim_imei) - 1);
            ESP_LOGI(TAG, "IMEI do modem: %s", modem_imei);
        }
    }

    // 5b. MSISDN do chip ativo
    ESP_LOGI(TAG, "[INIT] Step 5b: lendo numero do chip...");
    char msisdn_buf[20];
    if (simcom_driver_get_msisdn(msisdn_buf, sizeof(msisdn_buf)) == ESP_OK) {
        strncpy(bastao_current_status.sim_msisdn[bastao_current_status.active_sim_slot],
                msisdn_buf, sizeof(bastao_current_status.sim_msisdn[0]) - 1);
    }

    // 6. Reportes de registro
    ESP_LOGI(TAG, "[INIT] Step 6: habilitando reportes de rede...");
    at_send_cmd("AT+CREG=1\r\n", "OK", NULL, 0, 3000);
    at_send_cmd("AT+CGREG=1\r\n", "OK", NULL, 0, 3000);

    first_init_done = true;
    modem_state = SIMCOM_STATE_AT_READY;
    ESP_LOGI(TAG, "[INIT] Sequencia AT concluida com sucesso.");
    return ESP_OK;
}

static esp_err_t wait_for_network_registration(uint32_t timeout_ms) {
    uint32_t start = xTaskGetTickCount() * portTICK_PERIOD_MS;
    char resp[AT_RESPONSE_BUF_SIZE];

    while ((xTaskGetTickCount() * portTICK_PERIOD_MS - start) < timeout_ms) {
        esp_err_t err = at_send_cmd("AT+CREG?\r\n", "+CREG:", resp, sizeof(resp), 3000);
        if (err == ESP_OK) {
            if (strstr(resp, ",1") != NULL || strstr(resp, ",5") != NULL) {
                ESP_LOGI(TAG, "Modem registrado na rede celular.");
                return ESP_OK;
            }
        }
        vTaskDelay(pdMS_TO_TICKS(2000));
    }
    return ESP_ERR_TIMEOUT;
}

/* --- Metodos Publicos de Rede --- */

esp_err_t simcom_driver_init(void) {
    ESP_LOGI(TAG, "Inicializando driver serial SIMCom 7663E...");
    gps_powered_on = false;
    cellular_mqtt_connected = false;

    if (simcom_mutex == NULL) {
        simcom_mutex = xSemaphoreCreateMutex();
    }
    if (response_sem == NULL) {
        response_sem = xSemaphoreCreateBinary();
    }

    if (!uart_is_driver_installed(SIMCOM_UART_PORT)) {
        uart_config_t uart_config = {
            .baud_rate = SIMCOM_UART_BAUD_RATE,
            .data_bits = UART_DATA_8_BITS,
            .parity = UART_PARITY_DISABLE,
            .stop_bits = UART_STOP_BITS_1,
            .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
            .source_clk = UART_SCLK_DEFAULT,
        };

        ESP_ERROR_CHECK(uart_param_config(SIMCOM_UART_PORT, &uart_config));
        ESP_ERROR_CHECK(uart_set_pin(SIMCOM_UART_PORT, SIMCOM_UART_TX_PIN, SIMCOM_UART_RX_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));
        ESP_ERROR_CHECK(uart_driver_install(SIMCOM_UART_PORT, SIMCOM_UART_BUF_SIZE * 2, SIMCOM_UART_BUF_SIZE, 0, NULL, 0));
    }

    // PWRKEY GPIO setup
    gpio_config_t pwrkey_cfg = {
        .pin_bit_mask = BIT64(SIMCOM_PWRKEY_PIN),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&pwrkey_cfg);

    // Boot por hardware
    ESP_LOGI(TAG, "Pulso de boot (PWRKEY) no GPIO%d...", SIMCOM_PWRKEY_PIN);
    gpio_set_level(SIMCOM_PWRKEY_PIN, 1);
    vTaskDelay(pdMS_TO_TICKS(2000));
    gpio_set_level(SIMCOM_PWRKEY_PIN, 0);

    ESP_LOGI(TAG, "Aguardando inicializacao do hardware (10s)...");
    vTaskDelay(pdMS_TO_TICKS(10000));

    // Cria task de recepcao UART apenas se nao existir
    if (simcom_rx_task_handle == NULL) {
        xTaskCreatePinnedToCore(simcom_uart_rx_task, "simcom_rx", 4096, NULL, 6, &simcom_rx_task_handle, 1);
    } else {
        uart_flush(SIMCOM_UART_PORT);
    }

    esp_err_t err = at_init_sequence();
    if (err != ESP_OK) {
        modem_state = SIMCOM_STATE_ERROR;
        ESP_LOGE(TAG, "[INIT] Sequencia AT falhou (err=%d). SIMCom indisponivel.", err);
        return err;
    }

    // Inicializa o GPS
    simcom_driver_gps_power_on();

    ESP_LOGI(TAG, "[INIT] Driver SIMCom inicializado com sucesso.");
    return ESP_OK;
}

esp_err_t simcom_driver_configure_apn(const simcom_apn_config_t *apn_config) {
    if (apn_config == NULL) return ESP_ERR_INVALID_ARG;

    if (modem_state < SIMCOM_STATE_AT_READY) {
        ESP_LOGE(TAG, "Modem nao esta pronto.");
        return ESP_ERR_INVALID_STATE;
    }

    memcpy(&stored_apn, apn_config, sizeof(simcom_apn_config_t));

    esp_err_t err = wait_for_network_registration(60000);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Falha de registro na rede celular.");
        return err;
    }

    // GPRS Attach
    err = at_send_cmd("AT+CGATT=1\r\n", "OK", NULL, 0, 10000);
    if (err != ESP_OK) return err;

    // Configura PDP Context 1 com APN
    char apn_cmd[128];
    snprintf(apn_cmd, sizeof(apn_cmd), "AT+CGDCONT=1,\"IP\",\"%s\"\r\n", apn_config->apn);
    err = at_send_cmd(apn_cmd, "OK", NULL, 0, 5000);
    if (err != ESP_OK) return err;

    // Autenticacao PAP/CHAP
    if (strlen(apn_config->user) > 0) {
        char auth_cmd[256];
        snprintf(auth_cmd, sizeof(auth_cmd), "AT+CGAUTH=1,1,\"%s\",\"%s\"\r\n", apn_config->user, apn_config->password);
        at_send_cmd(auth_cmd, "OK", NULL, 0, 5000);
    }

    modem_state = SIMCOM_STATE_REGISTERED;
    ESP_LOGI(TAG, "APN '%s' configurada e registrada com sucesso.", apn_config->apn);

    // Coleta operadora e sinal apos registro
    {
        cellular_tech_t tech = CELLULAR_TECH_NONE;
        int mcc = 0, mnc = 0;
        char oper[32] = {0};
        if (simcom_driver_get_network_info(&tech, &mcc, &mnc, oper) == ESP_OK && oper[0] != '\0') {
            int slot = bastao_current_status.active_sim_slot;
            strncpy(bastao_current_status.sim_operator[slot], oper, sizeof(bastao_current_status.sim_operator[slot]) - 1);
            ESP_LOGI(TAG, "Operadora slot %d: %s", slot, oper);
        }
        int rssi = 99, ber = -1;
        if (simcom_driver_get_signal_quality(&rssi, &ber) == ESP_OK) {
            int slot = bastao_current_status.active_sim_slot;
            bastao_current_status.sim_rssi[slot] = rssi;
            ESP_LOGI(TAG, "Sinal slot %d: %d dBm", slot, rssi);
        }
    }

    return ESP_OK;
}

/* --- Motor MQTT Embutido --- */

