malufis/bastaoIOT-Gateway/esp32_firmware/main/simcom_driver.c
                // Formato: fix_mode,GPS_SVs,GLO_SVs,BDS_SVs,lat,N/S,lon,E/W,date,time,alt,spd,...
                int parsed = sscanf(data, "%d,%d,%d,%d,%lf,%c,%lf,%c,%*[^,],%*[^,],%f,%f",
                                    &fix_mode, &gps_svs, &glo_svs, &bds_svs,
                                    &lat_raw, &ns, &lon_raw, &ew, &alt, &spd);

                ESP_LOGI(TAG, "[GPS] CGNSSINFO parse: fix=%d sats=GPS:%d/GLO:%d/BDS:%d lat=%.4f%c lon=%.4f%c alt=%.1f",
                         fix_mode, gps_svs, glo_svs, bds_svs, lat_raw, ns, lon_raw, ew, alt);

                if (parsed >= 8 && fix_mode >= 1 && lat_raw > 0 && lon_raw > 0) {
                    int lat_deg = (int)(lat_raw / 100);
                    double lat_min = lat_raw - (lat_deg * 100);
                    gps_out->latitude = lat_deg + (lat_min / 60.0);
                    if (ns == 'S') gps_out->latitude = -gps_out->latitude;

                    int lon_deg = (int)(lon_raw / 100);
                    double lon_min = lon_raw - (lon_deg * 100);
                    gps_out->longitude = lon_deg + (lon_min / 60.0);
                    if (ew == 'W') gps_out->longitude = -gps_out->longitude;

                    gps_out->altitude = alt;
                    gps_out->speed_kmh = spd;
                    gps_out->valid = true;

                    ESP_LOGI(TAG, "[GPS] FIX OBTIDO (CGNSSINFO): Lat=%.6f, Lon=%.6f, Alt=%.1fm",
                             gps_out->latitude, gps_out->longitude, gps_out->altitude);
                    return ESP_OK;
                }
            }
        }
    }

    ESP_LOGI(TAG, "[GPS] Nenhum fix valido disponivel.");
    gps_out->valid = false;
    return ESP_ERR_NOT_FOUND;
}

esp_err_t simcom_driver_gps_power_on(void) {
    if (gps_powered_on) return ESP_OK;

    ESP_LOGI(TAG, "[GPS] Ativando receptor GNSS celular (Hot Start AP_Flash)...");
    esp_err_t err = at_send_cmd("AT+CGNSSPWR=1,1\r\n", "OK", NULL, 0, 9000);
    if (err != ESP_OK) {
        err = at_send_cmd("AT+CGNSSPWR=1\r\n", "OK", NULL, 0, 9000);
        if (err != ESP_OK) {
            err = at_send_cmd("AT+CGPS=1\r\n", "OK", NULL, 0, 9000);
        }
    }

    if (err == ESP_OK) {
        gps_powered_on = true;
        ESP_LOGI(TAG, "[GPS] GNSS ligado com sucesso.");
    }
    return err;
}

esp_err_t simcom_driver_gps_power_off(void) {
    if (!gps_powered_on) return ESP_OK;

    ESP_LOGI(TAG, "[GPS] Desligando receptor GNSS (Salva efemerides em Flash)...");
    esp_err_t err = at_send_cmd("AT+CGNSSPWR=0,1\r\n", "OK", NULL, 0, 9000);
    if (err != ESP_OK) {
        err = at_send_cmd("AT+CGNSSPWR=0\r\n", "OK", NULL, 0, 9000);
        if (err != ESP_OK) {
            err = at_send_cmd("AT+CGPS=0\r\n", "OK", NULL, 0, 9000);
        }
    }

    if (err == ESP_OK) {
        gps_powered_on = false;
        ESP_LOGI(TAG, "[GPS] GNSS desligado.");
    }
    return err;
}

/* --- Metricas e Diagnosticos Cellular --- */

static esp_err_t query_cpsi_metrics(void) {
    char resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err = at_send_cmd("AT+CPSI?\r\n", "+CPSI:", resp, sizeof(resp), 5000);
    if (err != ESP_OK) return err;

    char *p = strstr(resp, "+CPSI:");
    if (p == NULL) return ESP_FAIL;

    p += 6;
    while (*p == ' ') p++;

    if (strncmp(p, "LTE", 3) == 0) {
        char *fields[20] = {0};
        fields[0] = p;
        int f_idx = 1;
        char *c = p;

        while (*c != '\0' && f_idx < 20) {
            if (*c == ',') {
                *c = '\0';
                fields[f_idx++] = c + 1;
            }
            c++;
        }

        if (f_idx >= 15) {
            cached_rsrq = atoi(fields[11]);
            cached_rsrp = atoi(fields[12]);
            int rssi_cpsi = atoi(fields[13]);
            if (rssi_cpsi != 0) {
                cached_rssi = rssi_cpsi;
            }
            cached_sinr = atoi(fields[14]);
            return ESP_OK;
        }
    }
    return ESP_FAIL;
}

static esp_err_t query_ceer_log(void) {
    char resp[AT_RESPONSE_BUF_SIZE];
    esp_err_t err = at_send_cmd("AT+CEER\r\n", "+CEER:", resp, sizeof(resp), 5000);
    if (err != ESP_OK) return err;

    char *p = strstr(resp, "+CEER:");
    if (p == NULL) return ESP_FAIL;

    p += 6;
    while (*p == ' ' || *p == '"') p++;

    int idx = 0;
    while (p[idx] != '\0' && p[idx] != '\r' && p[idx] != '\n' && p[idx] != '"' && idx < sizeof(cached_ceer) - 1) {
        cached_ceer[idx] = p[idx];
        idx++;
    }
    cached_ceer[idx] = '\0';

    while (idx > 0 && cached_ceer[idx - 1] == ' ') {
        cached_ceer[idx - 1] = '\0';
        idx--;
    }
    return ESP_OK;
}

esp_err_t simcom_driver_get_signal_quality(int *rssi, int *ber) {
    char resp[128];
    esp_err_t err = at_send_cmd("AT+CSQ\r\n", "+CSQ:", resp, sizeof(resp), 9000);
    if (err != ESP_OK) return err;

    char *p = strstr(resp, "+CSQ:");
    if (p != NULL) {
        p += 5;
        int r = 99, b = -1;
        if (sscanf(p, "%d,%d", &r, &b) == 2) {
            if (r != 99) {
                // Converte RSSI AT para dBm
                cached_rssi = -113 + (r * 2);
            } else {
                cached_rssi = 99;
            }
            cached_ber = b;
            if (rssi) *rssi = cached_rssi;
            if (ber) *ber = cached_ber;
            return ESP_OK;
        }
    }
    return ESP_FAIL;
}

esp_err_t simcom_driver_get_network_info(cellular_tech_t *tech, int *mcc,
                                         int *mnc, char *operator_name) {
    // Tenta extrair info via comando de operador
    char resp[256];
    esp_err_t err = at_send_cmd("AT+COPS?\r\n", "+COPS:", resp, sizeof(resp), 65000);
    if (err == ESP_OK) {
        char *p = strstr(resp, "+COPS:");
        if (p != NULL) {
            p += 6;
            int mode = 0, format = 0;
            char op[32] = "";
            int act = -1;
            // Formato: +COPS: <mode>,<format>,"<oper>",<act>
            int parsed = sscanf(p, "%d,%d,\"%[^\"]\",%d", &mode, &format, op, &act);
            if (parsed >= 3) {
                strncpy(cached_operator_name, op, sizeof(cached_operator_name) - 1);
                if (act == 0) cached_tech = CELLULAR_TECH_2G;
                else if (act == 2) cached_tech = CELLULAR_TECH_3G;
                else if (act == 7) cached_tech = CELLULAR_TECH_4G_LTE;
                else if (act == 9) cached_tech = CELLULAR_TECH_NB_IOT;
            }
        }
    }

    query_cpsi_metrics();

    if (tech) *tech = cached_tech;
    if (operator_name) strncpy(operator_name, cached_operator_name, 31);
    
    // Leitura MNC/MCC
    char info_resp[128];
    if (at_send_cmd("AT+CIMI\r\n", "OK", info_resp, sizeof(info_resp), 5000) == ESP_OK) {
        char cimi[32];
        extract_digits(info_resp, cimi, sizeof(cimi));
        if (strlen(cimi) >= 5) {
            char mcc_str[4] = {cimi[0], cimi[1], cimi[2], '\0'};
            char mnc_str[3] = {cimi[3], cimi[4], '\0'};
            cached_mcc = atoi(mcc_str);
            cached_mnc = atoi(mnc_str);
        }
    }

    if (mcc) *mcc = cached_mcc;
    if (mnc) *mnc = cached_mnc;
    return ESP_OK;
}

esp_err_t simcom_driver_get_status(cellular_status_t *status) {
    if (status == NULL) return ESP_ERR_INVALID_ARG;

    status->rssi = cached_rssi;
    status->ber = cached_ber;
    status->tech = cached_tech;
    status->mcc = cached_mcc;
    status->mnc = cached_mnc;
    strncpy(status->operator_name, cached_operator_name, sizeof(status->operator_name) - 1);
    status->registered = (modem_state >= SIMCOM_STATE_REGISTERED);
    status->roaming = false;
    status->tx_bytes = 0;
    status->rx_bytes = 0;
    status->modem_state = modem_state;
    status->rsrp = cached_rsrp;
    status->rsrq = cached_rsrq;
    status->sinr = cached_sinr;
    strncpy(status->ceer, cached_ceer, sizeof(status->ceer) - 1);

    return ESP_OK;
}

